<template>
  <v-carousel v-if="isMobile()"
              cycle
              hide-delimiter-background
              height="800"
  >
    <v-carousel-item >
      <v-card
          color="#000426" class="white--text" rounded
          height="110%"
      >
        <v-row class="pa-8">
          <v-col>
            <v-card-title class=" ma-4">چگونه میتوانیم فروش موفق در چین داشته باشیم؟</v-card-title>
            <v-card-text class="white--text mr-2 text">
              در این مقاله سعی شده روش های نوین یک تجارت موفق در چین را بررسی کنیم.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
              متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده
              شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
              الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام
              و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </v-card-text>
            <v-card-actions class="btn-mobile">
              <v-btn color="#394DB8" class="white--text px-8 pa-4">
                دیدن مقاله
              </v-btn>
            </v-card-actions>
          </v-col>
        </v-row>
      </v-card>
    </v-carousel-item>

    <v-carousel-item >
      <v-card
          color="#000426" class="white--text" rounded
          height="110%"
      >
        <v-row class="pa-8">
          <v-col>
            <v-card-title class=" ma-4">چگونه میتوانیم فروش موفق در چین داشته باشیم؟</v-card-title>
            <v-card-text class="white--text mr-2 text">
              در این مقاله سعی شده روش های نوین یک تجارت موفق در چین را بررسی کنیم.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
              متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده
              شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
              الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام
              و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </v-card-text>
            <v-card-actions class="btn-mobile">
              <v-btn color="#394DB8" class="white--text px-8 pa-4">
                دیدن مقاله
              </v-btn>
            </v-card-actions>
          </v-col>
        </v-row>
      </v-card>
    </v-carousel-item>

    <v-carousel-item >
      <v-card
          color="#000426" class="white--text" rounded
          height="110%"
      >
        <v-row class="pa-8">
          <v-col>
            <v-card-title class=" ma-4">چگونه میتوانیم فروش موفق در چین داشته باشیم؟</v-card-title>
            <v-card-text class="white--text mr-2 text">
              در این مقاله سعی شده روش های نوین یک تجارت موفق در چین را بررسی کنیم.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
              متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده
              شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
              الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام
              و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </v-card-text>
            <v-card-actions class="btn-mobile">
              <v-btn color="#394DB8" class="white--text px-8 pa-4">
                دیدن مقاله
              </v-btn>
            </v-card-actions>
          </v-col>
        </v-row>
      </v-card>
    </v-carousel-item>
  </v-carousel>

  <v-carousel v-else
              cycle
              hide-delimiter-background
  >
    <v-carousel-item>
      <v-card
          color="#000426" class="white--text"
          rounded
      >
        <v-row class="d-flex pa-8">
          <v-col cols="7" >
            <v-card-title class="overflow-auto ma-4">چگونه میتوانیم فروش موفق در چین داشته باشیم؟</v-card-title>
            <p class="white--text overflow-auto">
              در این مقاله سعی شده روش های نوین یک تجارت موفق در چین را بررسی کنیم.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
              متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده
              شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
              الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام
              و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </p>
            <v-card-actions class="btn">
              <v-btn color="#394DB8" class="white--text px-8 pa-4">
                دیدن مقاله
              </v-btn>
            </v-card-actions>
          </v-col>

          <v-col cols="5">
            <v-img
                class="white--text overflow-auto"
                src="https://cdn.vuetifyjs.com/images/cards/docks.jpg"
                rounded
            ></v-img>
          </v-col>
        </v-row>
      </v-card>
    </v-carousel-item>

    <v-carousel-item>
      <v-card
          color="#000426" class="white--text" rounded
      >
        <v-row class="d-flex pa-8">
          <v-col cols="7" >
            <v-card-title class="text-wrap ma-4">چگونه میتوانیم فروش موفق در چین داشته باشیم؟</v-card-title>
            <v-card-text class="white--text text-wrap mr-4 text">
              در این مقاله سعی شده روش های نوین یک تجارت موفق در چین را بررسی کنیم.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
              متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده
              شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
              الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام
              و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </v-card-text>
            <v-card-actions class="btn">
              <v-btn color="#394DB8" class="white--text px-8 pa-4">
                دیدن مقاله
              </v-btn>
            </v-card-actions>
          </v-col>

          <v-col cols="5">
            <v-img
                class="white--text"
                src="https://cdn.vuetifyjs.com/images/cards/docks.jpg"
                rounded
            ></v-img>
          </v-col>
        </v-row>
      </v-card>
    </v-carousel-item>

    <v-carousel-item>
      <v-card
          color="#000426" class="white--text" rounded
      >
        <v-row class="d-flex pa-8">
          <v-col cols="7" >
            <v-card-title class="text-wrap ma-4">چگونه میتوانیم فروش موفق در چین داشته باشیم؟</v-card-title>
            <v-card-text class="white--text text-wrap mr-4 text">
              در این مقاله سعی شده روش های نوین یک تجارت موفق در چین را بررسی کنیم.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
              متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده
              شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
              الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام
              و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </v-card-text>
            <v-card-actions class="btn">
              <v-btn color="#394DB8" class="white--text px-8 pa-4">
                دیدن مقاله
              </v-btn>
            </v-card-actions>
          </v-col>

          <v-col cols="5">
            <v-img
                class="white--text"
                src="https://cdn.vuetifyjs.com/images/cards/docks.jpg"
                rounded
            ></v-img>
          </v-col>
        </v-row>
      </v-card>
    </v-carousel-item>

    <v-carousel-item>
      <v-card
          color="#000426" class="white--text" rounded
      >
        <v-row class="d-flex pa-8">
          <v-col cols="7" >
            <v-card-title class="text-wrap ma-4">چگونه میتوانیم فروش موفق در چین داشته باشیم؟</v-card-title>
            <v-card-text class="white--text text-wrap mr-4 text">
              در این مقاله سعی شده روش های نوین یک تجارت موفق در چین را بررسی کنیم.
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
              متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده
              شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
              الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام
              و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
              دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </v-card-text>
            <v-card-actions class="btn">
              <v-btn color="#394DB8" class="white--text px-8 pa-4">
                دیدن مقاله
              </v-btn>
            </v-card-actions>
          </v-col>

          <v-col cols="5">
            <v-img
                class="white--text"
                src="https://cdn.vuetifyjs.com/images/cards/docks.jpg"
                rounded
            ></v-img>
          </v-col>
        </v-row>
      </v-card>
    </v-carousel-item>
  </v-carousel>
</template>

<script>
export default{
  methods: {
    isMobile() {
      if(/Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent)) {
        return true
      }
      else {
        return false
      }
    }
  },
}

</script>

// why line height doesn't work?
<style scoped>
.text{
  line-height: 2rem;
}
.btn{
  margin: 4%;
  margin-top: 10%;
}
.btn-mobile{
  margin: 4%;
  margin-top: 8%;
}
</style>
